pitzDaily/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet_one
    {
        type            patch;
        nFaces          100;
        startFace       33700;
    }
    inlet_two
    {
        type            patch;
        nFaces          100;
        startFace       33800;
    }
    outlet
    {
        type            patch;
        nFaces          300;
        startFace       33900;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4100;
        startFace       34200;
    }
)

// ************************************************************************* //
